# print ("Hello world, а еще я говорю на русском")

# Задача 1 Арифметика
# 1st program
print (9**0.5*5)

# Задача 1 Логика
# 2nd program
print ((9.99>9.98) and (1000!=1000.1))

# Школьная загадка
# 3rd program
print (2*2+2 == 2*(2+2))

# Первый после точки
# 4-th program
print (int(float('123.456')*10)%10)